bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1281.xml
                <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xB1" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC2B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM22"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
                <register caption="Timer/Counter2 Output Compare Register B" name="OCR2B" offset="0xB4" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter2 Output Compare Register A" name="OCR2A" offset="0xB3" size="1"
                          mask="0xFF"/>
                <register caption="Asynchronous Status Register" name="ASSR" offset="0xB6" size="1">
                    <bitfield caption="Enable External Clock Input" mask="0x40" name="EXCLK"/>
                    <bitfield caption="Asynchronous Timer/Counter2" mask="0x20" name="AS2"/>
                    <bitfield caption="Timer/Counter2 Update Busy" mask="0x10" name="TCN2UB"/>
                    <bitfield caption="Output Compare Register2 Update Busy" mask="0x08" name="OCR2AUB"/>
                    <bitfield caption="Output Compare Register 2 Update Busy" mask="0x04" name="OCR2BUB"/>
                    <bitfield caption="Timer/Counter Control Register2 Update Busy" mask="0x02" name="TCR2AUB"/>
                    <bitfield caption="Timer/Counter Control Register2 Update Busy" mask="0x01" name="TCR2BUB"/>
                </register>
                <register caption="General Timer Counter Control register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSRASY"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC5">
                <register caption="Timer/Counter5 Control Register A" name="TCCR5A" offset="0x120" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM5A"/>
                    <bitfield caption="Compare Output Mode 5B, bits" mask="0x30" name="COM5B"/>
                    <bitfield caption="Compare Output Mode 5C, bits" mask="0x0C" name="COM5C"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM5"/>
                </register>
                <register caption="Timer/Counter5 Control Register B" name="TCCR5B" offset="0x121" size="1">
                    <bitfield caption="Input Capture 5 Noise Canceler" mask="0x80" name="ICNC5"/>
                    <bitfield caption="Input Capture 5 Edge Select" mask="0x40" name="ICES5"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM5" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 5" mask="0x07" name="CS5"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 5 Control Register C" name="TCCR5C" offset="0x122" size="1">
                    <bitfield caption="Force Output Compare 5A" mask="0x80" name="FOC5A"/>
                    <bitfield caption="Force Output Compare 5B" mask="0x40" name="FOC5B"/>
                    <bitfield caption="Force Output Compare 5C" mask="0x20" name="FOC5C"/>
                </register>
                <register caption="Timer/Counter5  Bytes" name="TCNT5" offset="0x124" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register A  Bytes" name="OCR5A" offset="0x128" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register B  Bytes" name="OCR5B" offset="0x12A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register B  Bytes" name="OCR5C" offset="0x12C" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Input Capture Register  Bytes" name="ICR5" offset="0x126" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Interrupt Mask Register" name="TIMSK5" offset="0x73" size="1">
                    <bitfield caption="Timer/Counter5 Input Capture Interrupt Enable" mask="0x20" name="ICIE5"/>
                    <bitfield caption="Timer/Counter5 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE5C"/>
                    <bitfield caption="Timer/Counter5 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE5B"/>
                    <bitfield caption="Timer/Counter5 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE5A"/>
                    <bitfield caption="Timer/Counter5 Overflow Interrupt Enable" mask="0x01" name="TOIE5"/>
                </register>
