bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1281.xml
                <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="The ADC Control and Status register A" name="ADCSRA" offset="0x7A" size="1"
                          ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC  Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS"
                              values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="The ADC Control and Status register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="" mask="0x40" name="ACME"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x08" name="MUX5"/>
                    <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS"
                              values="ANALOG_ADC_AUTO_TRIGGER"/>
                </register>
                <register caption="Digital Input Disable Register" name="DIDR2" offset="0x7D" size="1">
                    <bitfield caption="" mask="0x80" name="ADC15D"/>
                    <bitfield caption="" mask="0x40" name="ADC14D"/>
                    <bitfield caption="" mask="0x20" name="ADC13D"/>
                    <bitfield caption="" mask="0x10" name="ADC12D"/>
                    <bitfield caption="" mask="0x08" name="ADC11D"/>
                    <bitfield caption="" mask="0x04" name="ADC10D"/>
                    <bitfield caption="" mask="0x02" name="ADC9D"/>
                    <bitfield caption="" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="" mask="0x80" name="ADC7D"/>
                    <bitfield caption="" mask="0x40" name="ADC6D"/>
                    <bitfield caption="" mask="0x20" name="ADC5D"/>
                    <bitfield caption="" mask="0x10" name="ADC4D"/>
                    <bitfield caption="" mask="0x08" name="ADC3D"/>
                    <bitfield caption="" mask="0x04" name="ADC2D"/>
                    <bitfield caption="" mask="0x02" name="ADC1D"/>
                    <bitfield caption="" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF6">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Internal 1.1V Voltage Reference with external capacitor at AREF pin" name="VAL_0x02"
                       value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
            <value-group caption="" name="ADC_MUX_DIFF6">
                <value caption="ADC Single Ended Input pin 0" name="ADC0" value="0x00"/>
                <value caption="ADC Single Ended Input pin 1" name="ADC1" value="0x01"/>
                <value caption="ADC Single Ended Input pin 2" name="ADC2" value="0x02"/>
                <value caption="ADC Single Ended Input pin 3" name="ADC3" value="0x03"/>
                <value caption="ADC Single Ended Input pin 4" name="ADC4" value="0x04"/>
                <value caption="ADC Single Ended Input pin 5" name="ADC5" value="0x05"/>
                <value caption="ADC Single Ended Input pin 6" name="ADC6" value="0x06"/>
                <value caption="ADC Single Ended Input pin 7" name="ADC7" value="0x07"/>
                <value caption="ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain" name="ADC0_ADC0_10X"
                       value="0x08"/>
                <value caption="ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain" name="ADC1_ADC0_10X"
                       value="0x09"/>
                <value caption="ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain" name="ADC0_ADC0_200x"
                       value="0x0A"/>
                <value caption="ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain" name="ADC1_ADC0_200X"
                       value="0x0B"/>
                <value caption="ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain" name="ADC2_ADC2_10X"
                       value="0x0C"/>
                <value caption="ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain" name="ADC3_ADC2_10X"
                       value="0x0D"/>
                <value caption="ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain" name="ADC2_ADC2_200X"
                       value="0x0E"/>
                <value caption="ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain" name="ADC3_ADC2_200X"
                       value="0x0F"/>
                <value caption="ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain" name="ADC0_ADC1_1X"
                       value="0x10"/>
                <value caption="ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain" name="ADC1_ADC1_1X"
                       value="0x11"/>
                <value caption="ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain" name="ADC2_ADC1_1X"
                       value="0x12"/>
                <value caption="ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain" name="ADC3_ADC1_1X"
                       value="0x13"/>
                <value caption="ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain" name="ADC4_ADC1_1X"
                       value="0x14"/>
                <value caption="ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain" name="ADC5_ADC1_1X"
                       value="0x15"/>
                <value caption="ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain" name="ADC6_ADC1_1X"
                       value="0x16"/>
                <value caption="ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain" name="ADC7_ADC1_1X"
                       value="0x17"/>
                <value caption="ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain" name="ADC0_ADC2_1X"
                       value="0x18"/>
                <value caption="ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain" name="ADC1_ADC2_1X"
                       value="0x19"/>
                <value caption="ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain" name="ADC2_ADC2_1X"
                       value="0x1A"/>
                <value caption="ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain" name="ADC3_ADC2_1X"
                       value="0x1B"/>
                <value caption="ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain" name="ADC4_ADC2_1X"
                       value="0x1C"/>
                <value caption="ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain" name="ADC5_ADC2_1X"
                       value="0x1D"/>
                <value caption="Internal Reference (VBG)" name="ADC_VBG" value="0x1E"/>
                <value caption="0V (GND)" name="ADC_GND" value="0x1F"/>
                <value caption="ADC Single Ended Input pin 8" name="ADC8" value="0x20"/>
                <value caption="ADC Single Ended Input pin 9" name="ADC9" value="0x21"/>
                <value caption="ADC Single Ended Input pin 10" name="ADC10" value="0x22"/>
                <value caption="ADC Single Ended Input pin 11" name="ADC11" value="0x23"/>
                <value caption="ADC Single Ended Input pin 12" name="ADC12" value="0x24"/>
                <value caption="ADC Single Ended Input pin 13" name="ADC13" value="0x25"/>
                <value caption="ADC Single Ended Input pin 14" name="ADC14" value="0x26"/>
                <value caption="ADC Single Ended Input pin 15" name="ADC15" value="0x27"/>
                <value caption="ADC Differential Inputs Postive pin 8 Negative pin 8 10x Gain" name="ADC8_ADC8_10X"
                       value="0x28"/>
                <value caption="ADC Differential Inputs Postive pin 9 Negative pin 8 10x Gain" name="ADC9_ADC8_10X"
                       value="0x29"/>
                <value caption="ADC Differential Inputs Postive pin 8 Negative pin 8 200x Gain" name="ADC8_ADC8_200x"
                       value="0x2A"/>
                <value caption="ADC Differential Inputs Postive pin 9 Negative pin 8 200x Gain" name="ADC9_ADC8_200X"
                       value="0x2B"/>
                <value caption="ADC Differential Inputs Postive pin 10 Negative pin 10 10x Gain" name="ADC10_ADC10_10X"
                       value="0x2C"/>
                <value caption="ADC Differential Inputs Postive pin 11 Negative pin 10 10x Gain" name="ADC11_ADC10_10X"
                       value="0x2D"/>
                <value caption="ADC Differential Inputs Postive pin 10 Negative pin 10 200x Gain"
                       name="ADC10_ADC10_200X" value="0x2E"/>
                <value caption="ADC Differential Inputs Postive pin 11 Negative pin 10 200x Gain"
                       name="ADC11_ADC10_200X" value="0x2F"/>
                <value caption="ADC Differential Inputs Postive pin 8 Negative pin 9 1x Gain" name="ADC8_ADC9_1X"
                       value="0x30"/>
                <value caption="ADC Differential Inputs Postive pin 9 Negative pin 9 1x Gain" name="ADC9_ADC9_1X"
                       value="0x31"/>
                <value caption="ADC Differential Inputs Postive pin 10 Negative pin 9 1x Gain" name="ADC10_ADC9_1X"
                       value="0x32"/>
                <value caption="ADC Differential Inputs Postive pin 11 Negative pin 9 1x Gain" name="ADC11_ADC9_1X"
                       value="0x33"/>
                <value caption="ADC Differential Inputs Postive pin 12 Negative pin 9 1x Gain" name="ADC12_ADC9_1X"
                       value="0x34"/>
                <value caption="ADC Differential Inputs Postive pin 13 Negative pin 9 1x Gain" name="ADC13_ADC9_1X"
                       value="0x35"/>
                <value caption="ADC Differential Inputs Postive pin 14 Negative pin 9 1x Gain" name="ADC14_ADC9_1X"
                       value="0x36"/>
                <value caption="ADC Differential Inputs Postive pin 15 Negative pin 9 1x Gain" name="ADC15_ADC9_1X"
                       value="0x37"/>
                <value caption="ADC Differential Inputs Postive pin 8 Negative pin 10 1x Gain" name="ADC8_ADC10_1X"
                       value="0x38"/>
                <value caption="ADC Differential Inputs Postive pin 9 Negative pin 10 1x Gain" name="ADC9_ADC10_1X"
                       value="0x39"/>
                <value caption="ADC Differential Inputs Postive pin 10 Negative pin 10 1x Gain" name="ADC10_ADC10_1X"
                       value="0x3A"/>
                <value caption="ADC Differential Inputs Postive pin 11 Negative pin 10 1x Gain" name="ADC11_ADC10_1X"
                       value="0x3B"/>
                <value caption="ADC Differential Inputs Postive pin 12 Negative pin 10 1x Gain" name="ADC12_ADC10_1X"
                       value="0x3C"/>
                <value caption="ADC Differential Inputs Postive pin 13 Negative pin 10 1x Gain" name="ADC13_ADC10_1X"
                       value="0x3D"/>
            </value-group>
