bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1281.xml
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
                    <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
                </register>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
                    <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
                </register>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
                    <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
                    <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
                    <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
                    <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
                    <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
                    <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
                    <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
                    <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
                </register>
                <register caption="Power Reduction Register1" name="PRR1" offset="0x65" size="1">
                    <bitfield caption="Power Reduction Timer/Counter5" mask="0x20" name="PRTIM5"/>
                    <bitfield caption="Power Reduction Timer/Counter4" mask="0x10" name="PRTIM4"/>
                    <bitfield caption="Power Reduction Timer/Counter3" mask="0x08" name="PRTIM3"/>
                    <bitfield caption="Power Reduction USART3" mask="0x04" name="PRUSART3"/>
                    <bitfield caption="Power Reduction USART2" mask="0x02" name="PRUSART2"/>
                    <bitfield caption="Power Reduction USART1" mask="0x01" name="PRUSART1"/>
                </register>
                <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_SECTOR_LIMITS2">
                <value caption="LS = N/A, US = 0x1100 - 0xFFFF" name="VAL_0x00" value="0x00"/>
                <value caption="LS = 0x2200 - 0x1FFF, US = 0x2000 - 0xFFFF" name="VAL_0x01" value="0x01"/>
                <value caption="LS = 0x2200 - 0x3FFF, US = 0x4000 - 0xFFFF" name="VAL_0x02" value="0x02"/>
                <value caption="LS = 0x2200 - 0x5FFF, US = 0x6000 - 0xFFFF" name="VAL_0x03" value="0x03"/>
                <value caption="LS = 0x2200 - 0x7FFF, US = 0x8000 - 0xFFFF" name="VAL_0x04" value="0x04"/>
                <value caption="LS = 0x2200 - 0x9FFF, US = 0xA000 - 0xFFFF" name="VAL_0x05" value="0x05"/>
                <value caption="LS = 0x2200 - 0xBFFF, US = 0xC000 - 0xFFFF" name="VAL_0x06" value="0x06"/>
                <value caption="LS = 0x2200 - 0xDFFF, US = 0xE000 - 0xFFFF" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="CPU_WAIT_STATES">
                <value caption="No wait-states" name="VAL_0x00" value="0x00"/>
                <value caption="Wait one cycle during read/write strobe" name="VAL_0x01" value="0x01"/>
                <value caption="Wait two cycles during read/write strobe" name="VAL_0x02" value="0x02"/>
                <value caption="Wait two cycles during read/write and wait one cycle before driving out new address"
                       name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CPU_PIN_RELEASE">
                <value caption="None" name="VAL_0x00" value="0x00"/>
                <value caption="Px7" name="VAL_0x01" value="0x01"/>
                <value caption="Px7-Px6" name="VAL_0x02" value="0x02"/>
                <value caption="Px7-Px5" name="VAL_0x03" value="0x03"/>
                <value caption="Px7-Px4" name="VAL_0x04" value="0x04"/>
                <value caption="Px7-Px3" name="VAL_0x05" value="0x05"/>
                <value caption="Px7-Px2" name="VAL_0x06" value="0x06"/>
                <value caption="Full Port X" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP64" caption="TQFP64">
            <pin position="1" pad="PG5"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
        <pinout name="QFN64" caption="QFN64">
            <pin position="1" pad="PG5"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
    </pinouts>
</target-description-file>
